const err_string = {
    'ru_RU.UTF-8': {
        '-1': {'-1': 'Пустые входные данные'},
        '0': {'0': 'Логин существует'},
        '1': {'1': 'Неверный пароль'},
        '2': {'2': 'Неверный токен'},
        '3': {'3': 'Просроченный токен'},
        '4': {'4': 'Пользователь не зарегистрирован'},
        '5': {'5': 'Не найдено'},
        '300': {'300': 'Неизвестная ошибка'}
    },
    'en_US.UTF-8': {
        '-1': {'-1': 'Empty input data'},
        '0': {'0': 'Login exists'},
        '1': {'1': 'Wrong password'},
        '2': {'2': 'Wrong token'},
        '3': {'3': 'Token life end'},
        '4': {'4': 'User not registed'},
        '5': {'5': 'Not found'},
        '300': {'300': 'Unknow error'}
    }};

module.exports = err_string;